---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.HasDeformedShapeSettings
source: html/1f0d7b6d-dd0e-fd50-7195-64abdb409b4f.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.HasDeformedShapeSettings Method

If true style has deformed shape settings.

## Syntax (C#)
```csharp
public bool HasDeformedShapeSettings()
```